Revit 2027 API
BuiltInFailures.AutoRouteFailures.FailToDoCompatiblePhaseWarning Property
 The solution is failing to do the elements Phases are compatible.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailToDoCompatiblePhaseWarning { get; }
Public Shared ReadOnly Property FailToDoCompatiblePhaseWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailToDoCompatiblePhaseWarning {
	FailureDefinitionId^ get ();
}
static member FailToDoCompatiblePhaseWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace